import Link from 'next/link'
import React from 'react'
import { Container } from '../components/ui/Container'

const Error = () => {
	return (
		<main className='flex-1 flex items-center justify-center'>
			<Container className='flex flex-col items-center justify-center max-w-4xl'>
				<svg
					className='mb-7 lg:w-52 lg:h-52 md:w-36 md:h-36 w-24 h-24'
					width='200'
					height='200'
					viewBox='0 0 200 200'
					fill='none'
					xmlns='http://www.w3.org/2000/svg'
				>
					<path d="M100 38.6719C66.1836 38.6719 38.6719 66.1836 38.6719 100C38.6719 133.816 66.1836 161.328 100 161.328C133.816 161.328 161.328 133.816 161.328 100C161.328 66.1836 133.817 38.6719 100 38.6719ZM100 151.953C71.3531 151.953 48.0469 128.647 48.0469 100C48.0469 71.3531 71.3531 48.0469 100 48.0469C128.647 48.0469 151.953 71.3531 151.953 100C151.953 128.647 128.647 151.953 100 151.953ZM122.406 84.2238L106.629 100L122.406 115.777C124.237 117.607 124.237 120.575 122.406 122.406C121.491 123.321 120.291 123.779 119.091 123.779C117.892 123.779 116.692 123.321 115.777 122.406L100.001 106.629L84.2242 122.406C82.3934 124.237 79.4258 124.237 77.5949 122.406C75.7645 120.575 75.7645 117.607 77.5949 115.777L93.3715 100L77.5949 84.2238C75.7645 82.393 75.7645 79.4254 77.5949 77.5945C79.4258 75.7637 82.3934 75.7637 84.2242 77.5945L100.001 93.3711L115.777 77.5945C117.608 75.7637 120.575 75.7637 122.406 77.5945C124.237 79.4254 124.236 82.3934 122.406 84.2238ZM100 0C44.8598 0 0 44.8598 0 100C0 155.14 44.8598 200 100 200C155.14 200 200 155.14 200 100C200 44.8598 155.14 0 100 0ZM100 190.625C50.0293 190.625 9.375 149.971 9.375 100C9.375 50.0293 50.0293 9.375 100 9.375C149.971 9.375 190.625 50.0293 190.625 100C190.625 149.971 149.971 190.625 100 190.625Z" fill="white"/>
				</svg>
				<h1 className='h3 mb-5 text-center'>Ошибка!</h1>
				<p className=' mb-5 text-center'>Произошла ошибка попробуйте снова!</p>
				<p className=' text-center'>
					Или свяжитесь с нами на прямую:{' '}
					<Link className='underline transition-all hover:opacity-70' href='/contacts'>
						Контакты
					</Link>
				</p>
			</Container>
		</main>
	)
}

export default Error
